# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-shared/runs/run-9kaUBreGMN4d6ZvW

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common.module.cluster.cockroach_cluster.default: Refreshing state... [id=d5e95d51-8496-4e8d-977c-501839a34d0f]
module.common.module.cluster.aws_ssm_parameter.default: Refreshing state... [id=production-cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.module.kafka.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production-kafka-cluster-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common.module.kafka.upstash_kafka_cluster.default will be created
  + resource "upstash_kafka_cluster" "default" {
      + cluster_id              = (known after apply)
      + cluster_name            = "production-shared"
      + creation_time           = (known after apply)
      + id                      = (known after apply)
      + max_message_size        = (known after apply)
      + max_messages_per_second = (known after apply)
      + max_partitions          = (known after apply)
      + max_retention_size      = (known after apply)
      + max_retention_time      = (known after apply)
      + multizone               = false
      + password                = (sensitive value)
      + region                  = "ap-southeast-1"
      + rest_endpoint           = (known after apply)
      + state                   = (known after apply)
      + tcp_endpoint            = (known after apply)
      + type                    = (known after apply)
      + username                = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*